/*예제12-1*/
create database 동아리관리;

create table 동아리
(
동아리번호 CHAR(2) primary key
,동아리명 VARCHAR(20)
,동아리개설일 date
);

create table 동아리가입학생
(
동아리번호 CHAR(2)
,학번 Char(6) 
,이름 varchar(10)
,동아리가입일  DATE
,학과번호 char(2)
,학과명 varchar(20)
,primary key (동아리번호, 학번) /*여기 중요  복합PRIMARY KEY 설정시 묶어줘야함*/
, foreign key (동아리번호) references 동아리(동아리번호)
);

DROP TABLE 동아리가입학생;
insert into 동아리 (동아리번호,동아리명,동아리개설일) values 
('C1','지구한바퀴여행','2000-02-01')
,('C2','클래식연주동아리','2010-06-05')
,('C3','워너비골퍼','2020-03-01')
,('C4','댄스배틀','2021-07-01');

insert into 동아리가입학생(동아리번호, 학번, 이름, 동아리가입일, 학과번호, 학과명) values
('C1','231001','문지영','2023-04-01','D1','화학공학과')
,('C1','231002','배경민','2023-04-03','D4','경영학과')
,('C2','232001','김명희','2023-03-22','D2','통계학과')
,('C3','232002','전응정','2023-03-07','D2','통계학과')
,('C3','231002','배경민','2023-04-02','D4','경영학과')
,('C4','231001','문지영','2023-04-30','D1','화학공학과')
,('C4','233001','이현경','2023-03-27','D3','역사학과');

/*예제12-2*/
create table 학생학과
(
학번 Char(6) primary key
,이름 varchar(10)
,학과번호 char(2)
,학과명 varchar(20)
);

INSERT INTO 학생학과(학번, 이름, 학과번호, 학과명)
VALUES 
('231001','문지영','D1','화학공학과')
,('231002','배경민','D4','경영학과')
,('232001','김명희','D2','통계학과')
,('232002','전은정','D2','통계학과')
,('233001','이현경','D3','역사학과');

create table 동아리가입
(
동아리번호 char(2)
,학번 char(6)
,동아리가입일 date
,primary key (동아리번호, 학번)
, FOREIGN KEY (학번) REFERENCES 학생(학번)
, FOREIGN KEY (동아리번호) REFERENCES 동아리(동아리번호) 
);

INSERT INTO 동아리가입(동아리번호, 학번, 동아리가입일)
VALUES 
('C1','231001','2023-04-01')
,('C1','231002','2023-04-03')
,('C2','232001','2023-03-22')
,('C3','232002','2023-03-07')
,('C3','231002','2023-04-02')
,('C4','231001','2023-04-30')
,('C4','233001','2023-03-27');

/*예제12-3*/
CREATE TABLE 학과
(
학과번호 CHAR(2)
,학과명 VARCHAR(20)
, PRIMARY KEY (학과번호)
);

INSERT INTO 학과(학과번호, 학과명)
VALUES
('D1','화학공학과')
,('D2','통계학과')
,('D3','역사학과')
,('D4','경영학과');

CREATE TABLE 학생
(
학번 CHAR(6)
,이름 VARCHAR(10)
,학과번호 CHAR(6)
, primary key (학번)
, FOREIGN KEY (학과번호) REFERENCES 학과(학과번호)
);

INSERT INTO 학생(학번, 이름, 학과번호) VALUES
('231001','문지영','D1')
,('231002','배경민','D4')
,('232001','김명희','D2')
,('232002','전은정','D2')
,('233001','이현경','D3');

select * FROM 학과;
select * FROM 학생;
select * FROM 학생학과;
select * FROM 동아리;
select * FROM 동아리가입;
select * FROM 동아리가입학생;
